
## :white_check_mark: Apply Succeeded (cdn.koyashiro.net)

[CI link](https://github.com/koyashiro/infra/actions/runs/10795050791)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
cloudflare_r2_bucket.r2_bucket: Refreshing state... [id=cdn-koyashiro-net-lo6lrfo8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.cname_cdn will be created
  + resource "cloudflare_record" "cname_cdn" {
      + allow_overwrite = false
      + content         = (sensitive value)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cdn"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = (sensitive value)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
cloudflare_record.cname_cdn: Creating...
cloudflare_record.cname_cdn: Creation complete after 1s [id=f31762299cd7c64b6d4c0c626a0325e0]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":404,"Program":"tfcmt","SHA1":"eba5fd49ebc7191e9da1fb391721ed5bbd1e0343","Target":"cdn.koyashiro.net","Vars":{},"WorkflowName":"terraform"} -->